; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-77)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 - object)
 (:init 
    (arm-empty)
    (clear b22)
    (on b22 b4)
    (on b4 b17)
    (on b17 b12)
    (on b12 b10)
    (on-table b10)
    (clear b16)
    (on b16 b21)
    (on b21 b9)
    (on b9 b6)
    (on b6 b19)
    (on b19 b20)
    (on b20 b14)
    (on b14 b2)
    (on-table b2)
    (clear b3)
    (on b3 b15)
    (on-table b15)
    (clear b18)
    (on b18 b5)
    (on b5 b23)
    (on b23 b11)
    (on b11 b13)
    (on b13 b8)
    (on b8 b7)
    (on b7 b1)
    (on-table b1))
 (:goal (and 
(on b1 b19)
))
)

; plan
1. (unstack b18 b5)
   deleted: (on b18 b5) (clear b18) (arm-empty)
   added: (holding b18) (clear b5)
   goals met: 0 of 1
2. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 0 of 1
3. (unstack b5 b23)
   deleted: (on b5 b23) (clear b5) (arm-empty)
   added: (holding b5) (clear b23)
   goals met: 0 of 1
4. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 0 of 1
5. (unstack b16 b21)
   deleted: (on b16 b21) (clear b16) (arm-empty)
   added: (holding b16) (clear b21)
   goals met: 0 of 1
6. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 0 of 1
7. (unstack b23 b11)
   deleted: (on b23 b11) (clear b23) (arm-empty)
   added: (holding b23) (clear b11)
   goals met: 0 of 1
8. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 0 of 1
9. (unstack b11 b13)
   deleted: (on b11 b13) (clear b11) (arm-empty)
   added: (holding b11) (clear b13)
   goals met: 0 of 1
10. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 0 of 1
11. (unstack b13 b8)
   deleted: (on b13 b8) (clear b13) (arm-empty)
   added: (holding b13) (clear b8)
   goals met: 0 of 1
12. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 0 of 1
13. (unstack b21 b9)
   deleted: (on b21 b9) (clear b21) (arm-empty)
   added: (holding b21) (clear b9)
   goals met: 0 of 1
14. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 0 of 1
15. (unstack b8 b7)
   deleted: (on b8 b7) (clear b8) (arm-empty)
   added: (holding b8) (clear b7)
   goals met: 0 of 1
16. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 0 of 1
17. (unstack b7 b1)
   deleted: (on b7 b1) (clear b7) (arm-empty)
   added: (holding b7) (clear b1)
   goals met: 0 of 1
18. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 0 of 1
19. (unstack b9 b6)
   deleted: (on b9 b6) (clear b9) (arm-empty)
   added: (holding b9) (clear b6)
   goals met: 0 of 1
20. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 0 of 1
21. (unstack b6 b19)
   deleted: (on b6 b19) (clear b6) (arm-empty)
   added: (holding b6) (clear b19)
   goals met: 0 of 1
22. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 0 of 1
23. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 0 of 1
24. (stack b1 b19)
   deleted: (clear b19) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b19)
   goals met: 1 of 1
